<?php
return [
    'TIMES'                => [
        '8:30-10:10',
        '10:20-12:00',
        '12:20-14:00',
        '14:10-15:50',
        '16:00-17:40',
        '18:00-19:30',
        '19:40-21:10',
        '21:20-22:50',
    ],
    'WEEK'                 => [
        'Понедельник' => 'Monday',
        'Вторник'     => 'Tuesday',
        'Среда'       => 'Wednesday',
        'Четверг'     => 'Thursday',
        'Пятница'     => 'Friday',
        'Суббота'     => 'Saturday',
        'Воскресенье' => 'Sunday'
    ],
    'SUBJECT_TYPES'        => [
        'laboratory' => 'лабораторные занятия',
        'seminar'    => 'семинар',
        'lecture'    => 'лекции',
    ],
    'TEACHER_BY_DAY_MOCK'  => [
        [
            "start" => "8:30",
            "end"   => "10:10",
            "name"  => "Технологии интеллектуального анализа данных",
            "type"  => "Лекции",
            "place" => "0408",
        ],
        [
            "start" => "10:20",
            "end"   => "12:00",
            "name"  => "Операционные системы",
            "type"  => "Лекции",
            "place" => "0408",
        ],
        [
            "start" => "14:10",
            "end"   => "15:50",
            "name"  => "Прикладная физическая культура",
            "type"  => "Лекции",
            "place" => "Стадиoн",
        ],
        [
            "start" => "14:10",
            "end"   => "15:50",
            "name"  => "Прикладная физическая культура",
            "type"  => "Семинар",
            "place" => "Стадиoн",
        ],
        [
            "start" => "16:00",
            "end"   => "17:40",
            "name"  => "Прикладная физическая культура",
            "type"  => "Лекции",
            "place" => "Стадиoн",
        ],
        [
            "start" => "16:00",
            "end"   => "17:40",
            "name"  => "Прикладная физическая культура",
            "type"  => "Семинар",
            "place" => "Стадиoн",
        ],
    ],
    'TEACHER_BY_WEEK_MOCK' => [
        "Monday"    => [
            [
                "start" => "8:30",
                "end"   => "10:10",
                "name"  => "Управление данными",
                "type"  => "Лабораторные занятия",
                "place" => "247",
            ],
            [
                "start" => "10:20",
                "end"   => "12:00",
                "name"  => "Управление данными",
                "type"  => "Лабораторные занятия",
                "place" => "247",
            ],
            [
                "start" => "8:30",
                "end"   => "10:10",
                "name"  =>
                    "Технологии интеллектуального анализа данных",
                "type"  => "Лабораторные занятия",
                "place" => "235(з)",
            ],
            [
                "start" => "10:20",
                "end"   => "12:00",
                "name"  =>
                    "Технологии интеллектуального анализа данных",
                "type"  => "Лабораторные занятия",
                "place" => "235(з)",
            ],
            [
                "start" => "12:20",
                "end"   => "14:00",
                "name"  => "Управление данными",
                "type"  => "Семинар",
                "place" => "306(а)",
            ],
            [
                "start" => "14:10",
                "end"   => "15:50",
                "name"  => "Правоведение",
                "type"  => "Семинар",
                "place" => "506",
            ],
        ],
        "Tuesday"   => [
            [
                "start" => "10:20",
                "end"   => "12:00",
                "name"  => "Вычислительная математика",
                "type"  => "Лекции",
                "place" => "0408",
            ],
            [
                "start" => "12:20",
                "end"   => "14:00",
                "name"  =>
                    "Объектно-ориентированное программирование на языке высокого уровня.",
                "type"  => "Лекции",
                "place" => "0408",
            ],
            [
                "start" => "12:20",
                "end"   => "14:00",
                "name"  =>
                    "Технологии разработки программных средств",
                "type"  => "Лекции",
                "place" => "0408",
            ],
            [
                "start" => "14:10",
                "end"   => "15:50",
                "name"  =>
                    "Технологии разработки программных средств",
                "type"  => "Лекции",
                "place" => "0408",
            ],
            [
                "start" => "16:00",
                "end"   => "17:40",
                "name"  =>
                    "Технологии разработки программных средств",
                "type"  => "Лекции",
                "place" => "0408",
            ],
            [
                "start" => "16:00",
                "end"   => "17:40",
                "name"  => "Иностранный язык",
                "type"  => "Семинар",
                "place" => "410",
            ],
            [
                "start" => "18:00",
                "end"   => "19:30",
                "name"  => "Иностранный язык",
                "type"  => "Семинар",
                "place" => "410",
            ],
        ],
        "Wednesday" => [
            [
                "start" => "8:30",
                "end"   => "10:10",
                "name"  =>
                    "Технологии интеллектуального анализа данных",
                "type"  => "Лекции",
                "place" => "0408",
            ],
            [
                "start" => "10:20",
                "end"   => "12:00",
                "name"  => "Операционные системы",
                "type"  => "Лекции",
                "place" => "0408",
            ],
            [
                "start" => "14:10",
                "end"   => "15:50",
                "name"  => "Прикладная физическая культура",
                "type"  => "Лекции",
                "place" => "Стадиoн",
            ],
            [
                "start" => "14:10",
                "end"   => "15:50",
                "name"  => "Прикладная физическая культура",
                "type"  => "Семинар",
                "place" => "Стадиoн",
            ],
            [
                "start" => "16:00",
                "end"   => "17:40",
                "name"  => "Прикладная физическая культура",
                "type"  => "Лекции",
                "place" => "Стадиoн",
            ],
            [
                "start" => "16:00",
                "end"   => "17:40",
                "name"  => "Прикладная физическая культура",
                "type"  => "Семинар",
                "place" => "Стадиoн",
            ],
        ],
        "Thursday"  => [
            [
                "start" => "8:30",
                "end"   => "10:10",
                "name"  =>
                    "Объектно-ориентированное программирование на языке высокого уровня",
                "type"  => "Лабораторные занятия",
                "place" => "235(д)",
            ],
            [
                "start" => "10:20",
                "end"   => "12:00",
                "name"  =>
                    "Объектно-ориентированное программирование на языке высокого уровня",
                "type"  => "Лабораторные занятия",
                "place" => "235(д)",
            ],
            [
                "start" => "8:30",
                "end"   => "10:10",
                "name"  => "Операционные системы",
                "type"  => "Лабораторные занятия",
                "place" => "240(а)",
            ],
            [
                "start" => "10:20",
                "end"   => "12:00",
                "name"  => "Операционные системы",
                "type"  => "Лабораторные занятия",
                "place" => "240(а)",
            ],
            [
                "start" => "12:20",
                "end"   => "14:00",
                "name"  => "Физика",
                "type"  => "Лекции",
                "place" => "431",
            ],
            [
                "start" => "12:20",
                "end"   => "14:00",
                "name"  => "Иностранный язы",
                "type"  => "Семинар",
                "place" => "410",
            ],
            [
                "start" => "14:10",
                "end"   => "15:50",
                "name"  => "Правоведение",
                "type"  => "Лекции",
                "place" => "0408",
            ],
        ],
        "Friday"    => [
            [
                "start" => "8:30",
                "end"   => "10:10",
                "name"  =>
                    "Объектно-ориентированное программирование на языке высокого уровня",
                "type"  => "Семинар",
                "place" => "306",
            ],
            [
                "start" => "8:30",
                "end"   => "10:10",
                "name"  => "Физика",
                "type"  => "Семинар",
                "place" => "410",
            ],
            [
                "start" => "10:20",
                "end"   => "12:00",
                "name"  =>
                    "Теория вероятностей и математическая статистика",
                "type"  => "Семинар",
                "place" => "357(ж)",
            ],
            [
                "start" => "12:20",
                "end"   => "14:00",
                "name"  =>
                    "Технологии разработки программных средств",
                "type"  => "Лабораторные занятия",
                "place" => "249(б)",
            ],
            [
                "start" => "14:10",
                "end"   => "15:50",
                "name"  =>
                    "Технологии разработки программных средств",
                "type"  => "Лабораторные занятия",
                "place" => "249(б)",
            ],
            [
                "start" => "12:20",
                "end"   => "14:00",
                "name"  => "Физика",
                "type"  => "Лабораторные занятия",
                "place" => "417",
            ],
            [
                "start" => "14:10",
                "end"   => "15:50",
                "name"  => "Физика",
                "type"  => "Лабораторные занятия",
                "place" => "417",
            ],
            [
                "start" => "12:20",
                "end"   => "14:00",
                "name"  => "Вычислительная математика",
                "type"  => "Лабораторные занятия",
                "place" => "357(з)",
            ],
            [
                "start" => "14:10",
                "end"   => "15:50",
                "name"  => "Вычислительная математика",
                "type"  => "Лабораторные занятия",
                "place" => "357(з)",
            ],
        ],
        "Saturday"  => [
            [
                "start" => "8:30",
                "end"   => "10:10",
                "name"  =>
                    "Теория вероятностей и математическая статистика",
                "type"  => "Лекции",
                "place" => "0408",
            ],
            [
                "start" => "10:20",
                "end"   => "12:00",
                "name"  => "Управление данными",
                "type"  => "Лекции",
                "place" => "0408",
            ],
            [
                "start" => "12:20",
                "end"   => "14:00",
                "name"  => "Вычислительная математика",
                "type"  => "Семинар",
                "place" => "409",
            ],
            [
                "start" => "14:10",
                "end"   => "15:50",
                "name"  =>
                    "Технологии разработки программных средств",
                "type"  => "Семинар",
                "place" => "305",
            ],
        ],
        "Sunday"    => [],
    ],
];
