<?php
return [
    'TIMES' => [
        '8:30-10:10',
        '10:20-12:00',

        '12:20-14:00',
        '14:10-15:50',
        '16:00-17:40',
        '18:00-19:30',
        '19:40-21:10',
        '21:20-22:50',
    ],
    'WEEK' => [
        'Понедельник' => 'Monday',
        'Вторник'     => 'Tuesday',
        'Среда'       => 'Wednesday',
        'Четверг'     => 'Thursday',
        'Пятница'     => 'Friday',
        'Суббота'     => 'Saturday',
        'Воскресенье' => 'Sunday'
    ],
    'SUBJECT_TYPES' => [
        'laboratory' => 'лабораторные занятия',
        'seminar' => 'семинар',
        'lecture' => 'лекции',
    ]
];
